ЕРПУХАстенд.cbr_Основной/src/Documents/ЗаданиеНаПеревозку/ЗаданиеНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d371a3f9-8a6a-4f41-8820-d9a12b2d57af">
  <name>ЗаданиеНаПеревозку</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставке</registerRecords>
  <attributes>
    <name>cbr_КоличествоПаллет</name>
    <comment>//++ БаженоваЕО 09.02.2026 СКЛ.4</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_НомерЗаявкиПоДаннымПеревозчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_НомерПеревозкиAtrucks</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ФактическаяСтоимостьПеревозки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="15b3905e-1f40-4d8c-9f31-cde2f3907a9e">
    <name>Маршрут</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

ЕРПУХАстенд.cbr_Основной/src/AccumulationRegisters/cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставке/cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставке</name>
  <comment>//++ БаженоваЕО 02.02.2026 СКЛ.4</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>EnumRef.ВидыДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ЕРПУХАстенд.cbr_Основной/src/Documents/ЗаданиеНаПеревозку/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

//++ БаженоваЕО 09.02.2026 СКЛ.4
&НаКлиенте
Процедура cbr_ПриОткрытииПосле(Отказ)
	cbr_ЗаполнитьТаблицуТоваровКДоставке();
КонецПроцедуры //-- БаженоваЕО 09.02.2026

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМаршрут

&После("МаршрутОбъемПриИзменении")
&НаКлиенте
Процедура cbr_МаршрутОбъемПриИзменении(Элемент)
	//++cbr-larkovgeorg 26.02.2026 СКЛ.12
	Объект.cbr_КоличествоПаллет = ИтоговоеКоличествоПаллетов();
	//--cbr-larkovgeorg 26.02.2026 СКЛ.12
КонецПроцедуры

&НаКлиенте
Процедура cbr_МаршрутПриИзмененииПосле(Элемент)
	//++cbr-larkovgeorg 26.02.2026 СКЛ.12
	Объект.cbr_КоличествоПаллет = ИтоговоеКоличествоПаллетов();
	//--cbr-larkovgeorg 26.02.2026 СКЛ.12
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ БаженоваЕО 09.02.2026 СКЛ.4
&НаСервере
Процедура cbr_ЗаполнитьТаблицуТоваровКДоставке()

	Если Не ЗначениеЗаполнено(Объект.Ссылка) И Объект.Распоряжения.Количество() Тогда
		Если ТипЗнч(Объект.Распоряжения[0].Распоряжение) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда

			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставкеОстатки.Номенклатура КАК Номенклатура,
			|	cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставкеОстатки.Характеристика КАК Характеристика,
			|	cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставкеОстатки.Назначение КАК Назначение,
			|	cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставкеОстатки.Серия КАК Серия,
			|	cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставкеОстатки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставкеОстатки.КоличествоОстаток КАК КоличествоОстаток
			|ИЗ
			|	РегистрНакопления.cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставке.Остатки(, Распоряжение = &Распоряжение) КАК
			|		cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставкеОстатки";

			Запрос.УстановитьПараметр("Распоряжение", Объект.Распоряжения[0].Распоряжение);

			РезультатЗапроса = Запрос.Выполнить();

			Если Не РезультатЗапроса.Пустой() Тогда

				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

					ТоварыКДоставкеСтрока = ТоварыКДоставке.Добавить();
					ТоварыКДоставкеСтрока.Склад = Объект.Распоряжения[0].Распоряжение.Склад;
					ТоварыКДоставкеСтрока.Распоряжение = Объект.Распоряжения[0].Распоряжение;
					ТоварыКДоставкеСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
					ТоварыКДоставкеСтрока.Характеристика = ВыборкаДетальныеЗаписи.Характеристика;
					ТоварыКДоставкеСтрока.Назначение = ВыборкаДетальныеЗаписи.Назначение;
					ТоварыКДоставкеСтрока.Серия = ВыборкаДетальныеЗаписи.Серия;
					ТоварыКДоставкеСтрока.Количество = ВыборкаДетальныеЗаписи.КоличествоОстаток;

				КонецЦикла;

			КонецЕсли;

		ИначеЕсли ТипЗнч(Объект.Распоряжения[0].Распоряжение) = Тип("ДокументСсылка.ЗаказКлиента") Тогда

			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставкеОстатки.Номенклатура КАК Номенклатура,
			|	cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставкеОстатки.Характеристика КАК Характеристика,
			|	cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставкеОстатки.Назначение КАК Назначение,
			|	cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставкеОстатки.Серия КАК Серия,
			|	cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставкеОстатки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставкеОстатки.КоличествоОстаток КАК КоличествоОстаток
			|ИЗ
			|	РегистрНакопления.cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставке.Остатки(, Распоряжение = &Распоряжение) КАК
			|		cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставкеОстатки";

			Запрос.УстановитьПараметр("Распоряжение", Объект.Распоряжения[0].Распоряжение);

			РезультатЗапроса = Запрос.Выполнить();

			Если Не РезультатЗапроса.Пустой() Тогда

				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

					ТоварыКДоставкеСтрока = ТоварыКДоставке.Добавить();
					ТоварыКДоставкеСтрока.Склад = Объект.Распоряжения[0].Распоряжение.Склад;
					ТоварыКДоставкеСтрока.Распоряжение = Объект.Распоряжения[0].Распоряжение;
					ТоварыКДоставкеСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
					ТоварыКДоставкеСтрока.Характеристика = ВыборкаДетальныеЗаписи.Характеристика;
					ТоварыКДоставкеСтрока.Назначение = ВыборкаДетальныеЗаписи.Назначение;
					ТоварыКДоставкеСтрока.Серия = ВыборкаДетальныеЗаписи.Серия;
					ТоварыКДоставкеСтрока.Количество = ВыборкаДетальныеЗаписи.КоличествоОстаток;

				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры //-- БаженоваЕО 09.02.2026

&НаСервере
Функция ИтоговоеКоличествоПаллетов()
	//++cbr-larkovgeorg 26.02.2026 СКЛ.12
	ИтоговыйОбъем = Объект.Маршрут.Итог("Объем");
	КоличествоПаллетов = Цел(ИтоговыйОбъем/2.16) + 1;
	
	Возврат КоличествоПаллетов
	
КонецФункции//--cbr-larkovgeorg 26.02.2026 СКЛ.12

#КонецОбласти
